import json

str1 = '[{"alt": "为节省成本 捷豹路虎削减英国更多工作岗位", ' \
       '"font": {"height": 326, "width": 550}, "type": ' \
       '"img", "url": "http://cdn.autoforce.net/cyx/image' \
       's/2018/06/13/PIdZ-hcwpcmq0915958.png"}, {"comment":' \
       ' "据外媒报道,当地时间6月11日,捷豹路虎宣布,计划将其在英国一座工厂的' \
       '路虎发现(Discovery)生产工作转移到成本较低的斯洛伐克,以生产新款路虎揽胜' \
       '。因此,该公司将在英国削减更多的工作岗位。", "type": "text"}, {"comment": "",' \
       ' "type": "text"}, {"comment": "去年,该公司首席财务官Ken Gregor表示,将生产从英国转移' \
       '至斯洛伐克可使每辆车的成本降低数千英镑。该公司在一份声明中表示,“在英国,虽然一些机构雇佣' \
       '员工的潜在损失对公司来说很困难,但在我们转变全球业务的过程中,这是我们长' \
       '期生产战略的一部分。” 捷豹路虎在斯洛伐克Nitra的新工厂将于今年年底前投产,产能将达3' \
       '0万辆。由于即将投产,该工厂已雇佣了1,400名员工。捷豹路虎在2016年表示,一旦斯洛伐克新工厂投产,' \
       '将在该厂生产路虎发现。", "type": "text"}, {"comment": "", "type": "text"}, {"comment"' \
       ': "新款路虎揽胜和路虎揽胜运动版将在该公司英国Solihull工厂基于一个架构生产,该架构可同时生产柴油车、' \
       '汽油车、电动车和混动车。部分2017年重新设计的车型将继续在英国生产。", "type": "text"}, {"comment' \
       '": "", "type": "text"}, {"comment": "由于市场对柴油车的需求下降,此前,捷豹路虎今年宣布将削减1,000' \
       '份工作岗位,并降低该公司在英国的两家工厂的产量。去年,捷豹路虎在英国的三个工厂产量超过53万辆,并有一个单独的' \
       '发动机工厂和总部,员工约有 4万人。英国170万辆车中近三分之一的车辆由该公司生产。今年4月,一名消息人士向路透社表示,该公司还' \
       '指责英国脱欧打击了欧洲第二大汽车市场——英国的需求,去年,英国市场需求量下降了6%。", "type": "text"}, {"comment": "",' \
       ' "type": "text"}, {"comment": "此前,该公司宣布,2020年实现全面电动化,即所有新车将推出电动或混动版本。今年1月份,捷豹' \
       '路虎表示,今年将决定是否在英国市场生产电动汽车。但是该公司一名发言人不愿证实,将在英国Solihull工厂生产的路虎揽胜是否是纯电动版,' \
       '目前,E-Pace和I-Pace两款SUV都有插电式混合动力版。", "type": "text"}, {"comment": "", "type": "text"}, {"c' \
       'omment": "捷豹路虎也在中国常熟生产SUV。捷豹路虎还和制造商麦格纳斯太尔达成协议,将在奥地利生产捷豹E-Pace和其第一款' \
       '纯电动车型I-Pace。", "type": "text"}, {"comment": "(责编:李硕)", "type": "text"}]'

one_res = json.loads(str1)

for one in one_res:
    print(one)
    print(type(one))

str2 = '[{"comment": "1212312313123", "type": "text"}, {"comment": "br/>", "type": "text"}, ' \
       '{"comment": "", "type": "text"}, {"type": "img", "font": {"width": 690, "height": 600}}, ' \
       '{"comment": "", "type": "text"}]'

res2 = json.loads(str2)
for one in res2:
       print(one)